backend: tensorflow
class_name: Sequential
config:
- class_name: BatchNormalization
  config:
    axis: -1
    batch_input_shape: !!python/tuple [null, 96, 96, 1]
    beta_constraint: null
    beta_initializer:
      class_name: Zeros
      config: {}
    beta_regularizer: null
    center: true
    dtype: float32
    epsilon: 0.001
    gamma_constraint: null
    gamma_initializer:
      class_name: Ones
      config: {}
    gamma_regularizer: null
    momentum: 0.99
    moving_mean_initializer:
      class_name: Zeros
      config: {}
    moving_variance_initializer:
      class_name: Ones
      config: {}
    name: batch_normalization_2
    scale: true
    trainable: true
- class_name: Conv2D
  config:
    activation: linear
    activity_regularizer: null
    batch_input_shape: !!python/tuple [null, 96, 96, 1]
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: &id001 !!python/tuple [1, 1]
    dtype: float32
    filters: 24
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5, 5]
    name: conv2d_6
    padding: same
    strides: &id002 !!python/tuple [1, 1]
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: elu, name: activation_6, trainable: true}
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    name: max_pooling2d_5
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: true
- class_name: Dropout
  config: {name: dropout_7, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Conv2D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 36
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5, 5]
    name: conv2d_7
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: elu, name: activation_7, trainable: true}
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    name: max_pooling2d_6
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: true
- class_name: Dropout
  config: {name: dropout_8, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Conv2D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 48
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5, 5]
    name: conv2d_8
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: elu, name: activation_8, trainable: true}
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    name: max_pooling2d_7
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: true
- class_name: Dropout
  config: {name: dropout_9, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Conv2D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_9
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: elu, name: activation_9, trainable: true}
- class_name: MaxPooling2D
  config:
    data_format: channels_last
    name: max_pooling2d_8
    padding: valid
    pool_size: !!python/tuple [2, 2]
    strides: !!python/tuple [2, 2]
    trainable: true
- class_name: Dropout
  config: {name: dropout_10, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Conv2D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_10
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Activation
  config: {activation: elu, name: activation_10, trainable: true}
- class_name: GlobalAveragePooling2D
  config: {data_format: channels_last, name: global_average_pooling2d_2, trainable: true}
- class_name: Dropout
  config: {name: dropout_11, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Dense
  config:
    activation: elu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_4
    trainable: true
    units: 500
    use_bias: true
- class_name: Dropout
  config: {name: dropout_12, noise_shape: null, rate: 0.5, seed: null, trainable: true}
- class_name: Dense
  config:
    activation: tanh
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_5
    trainable: true
    units: 90
    use_bias: true
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_6
    trainable: true
    units: 22
    use_bias: true
keras_version: 2.0.9
